soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:tem="http://tempuri.org/">
  <soapenv:Header>
    <wsse:Security
      xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
      xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <xenc:EncryptedKey Id="EK-4AE4CC90BC60FF145B15714833744121"
        xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
        <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/>
        <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <wsse:SecurityTokenReference>
            <ds:X509Data>
              <ds:X509IssuerSerial>
                <ds:X509IssuerName>
                  1.2.840.113549.1.9.1=#16156d2e616c6176693139383640676d61696c2e636f6d,CN=Mohammad
                  Alavi,OU=Alavisoft,O=Alavisoft,L=Esenyurt,ST=Istanbul,C=TR
                </ds:X509IssuerName>
                <ds:X509SerialNumber>256504619521706517199930160791142284553014746424
                </ds:X509SerialNumber>
              </ds:X509IssuerSerial>
            </ds:X509Data>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
        <xenc:CipherData>
          <xenc:CipherValue>
            J7Em8f1VfOcahViFSMk8ouJ+4j13nyLRDqdPQ+DUQ1WvADixxw7aDsJVSgtyOsLKGwzhnVvjmyQxlmonmPEeIxhvRJVa4yJU6RHKXTln2FMGS6/Ok1C7nA8yi3BLfCZBJbmzLD1KHKHr3jGvKe0iOo6WdJbZpbalqi8Ne0QXYIU=
          </xenc:CipherValue>
        </xenc:CipherData>
        <xenc:ReferenceList>
          <xenc:DataReference URI="#ED-4AE4CC90BC60FF145B15714833744362"/>
        </xenc:ReferenceList>
      </xenc:EncryptedKey>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <xenc:EncryptedData Id="ED-4AE4CC90BC60FF145B15714833744362"
      Type="http://www.w3.org/2001/04/xmlenc#Content"
      xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
      <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/>
      <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
        <wsse:SecurityTokenReference
          wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"
          xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
          xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd">
          <wsse:Reference URI="#EK-4AE4CC90BC60FF145B15714833744121"/>
        </wsse:SecurityTokenReference>
      </ds:KeyInfo>
      <xenc:CipherData>
        <xenc:CipherValue>
          SdV7Sa9G2pIQ3LpNBvfgB0x7WmqyC7xQHE/8tqCeDlfkqBa4G9ua/y2bW85aOcaEKW7oZ3NabgHUyOQ01uhrCKc4pQeK5FkenSEfSfZc01gQHB7JD7KvKU6WHQqg9Ow3D2fCrWq1yt6GFTC1u1gKz8c6x4xyEL9VMzn7zR51d3G3+fVpnsPqRWNu/TiTneyk
        </xenc:CipherValue>
      </xenc:CipherData>
    </xenc:EncryptedData>
  </soapenv:Body>
</soapenv:Envelope>